Anuo-shuo/iZone/projects/stm32f103zet6-atk-elite/application/main.c
/* 索引
include
define
int
信号量
TASK配置及函数声明
函数
主函数
*/

//MOLINK
#include <board.h>
#include <os_task.h>
#include <oneos_config.h>
#include <dlog.h>
#include <shell.h>
#include <fal/fal.h>
#include <os_memory.h>
#include <rtc/rtc.h>
#include <os_clock.h>
#include "atk_tflcd9341.h"
#include <mo_api.h>
#include <stdlib.h>
#include <unistd.h>
#include "MQTTOneOS.h"
#include "oneos_config.h"
#include "token.h"
#include "onenet_mqtts.h"
#include <esp8266.h>
//OTA
#include <cmiot_user.h>

//ATK
#include "atk_lcd.h"
#include "atk_key.h"

//RC522
#include "RC522.h"

//PWM
#include <drv_cfg.h>
#include <device.h>
#include <timer/clocksource.h>

//设备
#include "my_device.h"

//SHT40
//#include "sht40/sht4x.h"

//上传的消息
#include "upload_msg.h"

//传感器
#include <stdio.h>
#include <sensors/sensor.h>


#define RECV_BUF_LEN     (1024)
#define TEST_MODULE_NAME "esp8266"
#define AP_SSID          "201RIGHT"
#define AP_PASSWORD      "erlingyiyou"

//MQTT收到的控制数据（1字节）
char mqtt_receive_data;

//传感器sensor数据
//传感器name： temp_aht10 humi_aht10 
struct os_sensor_data sensor_data_temp;
struct os_sensor_data sensor_data_humi;


//设备定义
os_device_t *adc_1;
os_device_t *adc_2;
os_device_t *adc_3;
os_device_t *os_uart_3;
os_pwm_device_t *pwm_dev = OS_NULL;
os_timer_t *TIMER_PERIODIC = OS_NULL;
//os_device_t *sensor_temp;
//os_device_t *sensor_humi;
/********************************************************************************************************/
/* 数据定义 */
//当前设备状态
//struct device_state{
//	unsigned int  temperature;	//温度
//	unsigned int  humidity;		//湿度
//	unsigned int  power;		//功率
//	unsigned char  sound;		//噪声(数字量)
//	unsigned char light_d;		//光强（数字量）
//	unsigned int  light_b;		//板载光强
//	unsigned int  light;		//光强
//	unsigned char mq2_d;		//烟雾（数字量）
//	unsigned int  mq2;			//烟雾
//	unsigned char box1;			//器件盒1（数字量）
//	unsigned char box2;			//器件盒2（数字量）
//	unsigned char touch;		//触摸开关（数字量）
//	unsigned char human;		//人体存在（数字量）
//	unsigned char door;			//门（数字量）
//	
//	unsigned char motor;		//电机状态
//	unsigned char alarm;		//警报状态
//	unsigned char relay1;		//继电器1状态
//	unsigned char relay2;		//继电器2状态
//	
//}device_state;

//控制设备
struct device_control{

	unsigned char door;			//门
	//四合一
//	unsigned char motor;		//电机
//	unsigned char alarm;		//警报
//	unsigned char relay1;		//继电器1
//	unsigned char relay2;		//继电器2
	//四合一
	unsigned char d_switch;

	
}device_control;

struct lcd_conf{

	int page;			//页
	int cursor;			//指针
	
	
}lcd_conf;



/********************************************************************************************************/
/* 信号量定义 */
static os_sem_t* sem_ota;	//ota信号量
static os_sem_t* sem_lcd;	//lcd信号量
//extern os_sem_t* mqtt_task1;	//mqtt_task1信号量
os_sem_t* sem_mqtt_task1;	//mqtt_task1信号量
os_sem_t* sem_mqtt_task2;	//mqtt_task2信号量
//os_sem_t* sem_mqtt_task3;	//mqtt_task3信号量
os_sem_t* sem_door;			//door信号量
os_sem_t* sem_nfc;			//nfc信号量
os_sem_t* sem_lend;			//外借任务信号量
os_sem_t* sem_lend_post;			//外借任务信号量
/* oneOS配置************************************************************************************** */
/* MQTT_TASK 任务 配置
 * 包括: 任务句柄 任务优先级 堆栈大小 创建任务
 */
 

//MQTT任务配置
#define MQTT_TASK_PRIO    6              /* 任务优先级 */
#define MQTT_STK_SIZE     2048           /* 任务堆栈大小 */
os_task_t *MQTT_Handler;                 /* 任务控制块 */
void mqtt_task(void *parameter);  /* 任务函数 */


//KEY任务配置
#define KEY_TASK_PRIO    7              /* 任务优先级 */
#define KEY_STK_SIZE     512            /* 任务堆栈大小 */
os_task_t *KEY_Handler;                 /* 任务控制块 */
void key_task(void *parameter);  /* 任务函数 */


//OTA任务配置
#define OTA_TASK_PRIO    17              /* 任务优先级 */
#define OTA_STK_SIZE     2048           /* 任务堆栈大小 */
os_task_t *OTA_Handler;                 /* 任务控制块 */
void ota_task(void *parameter); /* 任务函数 */

//LCD任务配置
#define LCD_TASK_PRIO    9             /* 任务优先级 */
#define LCD_STK_SIZE     1024           /* 任务堆栈大小 */
os_task_t *LCD_Handler;                 /* 任务控制块 */
void lcd_task(void *parameter); /* 任务函数 */

//MQTT_TASK1任务配置
#define MQTT_TASK1_TASK_PRIO    5             /* 任务优先级 */
#define MQTT_TASK1_STK_SIZE     512            /* 任务堆栈大小 */
os_task_t *MQTT_TASK1_Handler;                 /* 任务控制块 */
void mqtt_task1(void *parameter); /* 任务函数 */

//MQTT_TASK2任务配置
#define MQTT_TASK2_TASK_PRIO    14            /* 任务优先级 */
#define MQTT_TASK2_STK_SIZE     512           /* 任务堆栈大小 */
os_task_t *MQTT_TASK2_Handler;                 /* 任务控制块 */
void mqtt_task2(void *parameter); /* 任务函数 */
//MQTT_TASK3任务配置
#define MQTT_TASK3_TASK_PRIO    11             /* 任务优先级 */
#define MQTT_TASK3_STK_SIZE     512            /* 任务堆栈大小 */
os_task_t *MQTT_TASK3_Handler;                 /* 任务控制块 */
void mqtt_task3(void *parameter); /* 任务函数 */

//MQTT_CMD任务配置
#define MQTT_CMD_TASK_PRIO    10             /* 任务优先级 */
#define MQTT_CMD_STK_SIZE     512            /* 任务堆栈大小 */
os_task_t *MQTT_CMD_Handler;                 /* 任务控制块 */
void mqtt_cmd(void *parameter); /* 任务函数 */

//RC522任务配置
#define RC522_TASK_PRIO    18             /* 任务优先级 */
#define RC522_STK_SIZE     512            /* 任务堆栈大小 */
os_task_t *RC522_Handler;                 /* 任务控制块 */
void rc522_task(void *parameter); /* 任务函数 */

//DOOR任务配置
#define DOOR_TASK_PRIO    17             /* 任务优先级 */
#define DOOR_STK_SIZE     512            /* 任务堆栈大小 */
os_task_t *DOOR_Handler;                 /* 任务控制块 */
void door_task(void *parameter); /* 任务函数 */

//ADC任务配置
#define ADC_TASK_PRIO    11             /* 任务优先级 */
#define ADC_STK_SIZE     1024            /* 任务堆栈大小 */
os_task_t *ADC_Handler;                 /* 任务控制块 */
void adc_task(void *parameter); /* 任务函数 */

//NFC任务配置
#define NFC_TASK_PRIO    11             /* 任务优先级 */
#define NFC_STK_SIZE     1024            /* 任务堆栈大小 */
os_task_t *NFC_Handler;                 /* 任务控制块 */

//LEND POST任务配置
#define LEND_TASK_PRIO    10            /* 任务优先级 */
#define LEND_STK_SIZE     512            /* 任务堆栈大小 */
os_task_t *LEND_Handler;                 /* 任务控制块 */
void lend_cmd(void *parameter); /* 任务函数 */

// SERIAL_TASK 任务 配置
#define SERIAL_TASK_PRIO        18       /* 任务优先级 */
#define SERIAL_STK_SIZE         512     /* 任务堆栈大小 */
os_task_t *SERIAL_Handler;              /* 任务控制块 */
void serial_task(void *parameter);      /* 任务函数 */

#define USART2_MAX_RX_LEN    20                 /* 最大接收缓存字节数 */
os_uint8_t USART2_RX_BUF[USART2_MAX_RX_LEN];    /* 接收缓冲,最大USART2_MAX_RECV_LEN个字节. */


os_uint8_t k_back=0;//按下返回键

