Anuo-shuo/iZone/projects/stm32f103zet6-atk-elite/application/main.c
os_uint8_t k_ok=0;//按下确认键
char is_using_lend=0;
void nfc_task(void *parameter); /* 任务函数 */
/********************************************************************************************************/
/* 构建消息 */

extern struct os_mq mqtts_mq;


/**
 * @brief       串口3设备初始化
 * @param       无
 * @retval      返回设备句柄
 */
os_device_t *os_usart_2_init()
{
    os_device_t *os_uart_2;
    os_uart_2 = os_device_find("uart2");                            /* 寻找设备 */
    os_device_open(os_uart_2);                                      /* 打开设备 */
    struct serial_configure config = OS_SERIAL_CONFIG_DEFAULT;      /* 设置默认 */
    os_device_control(os_uart_2, OS_DEVICE_CTRL_CONFIG, &config);   /* 管理设备 */
    
    return os_uart_2;
}

/**
 * @brief       serial_task
 * @param       parameter : 传入参数(未用到)
 * @retval      无
 */
static void serial_task(void *parameter)
{
    parameter = parameter;
    os_uint32_t rx_cnt = 0;
    os_uint8_t i;

     memset(USART2_RX_BUF, 0, USART2_MAX_RX_LEN);
    
    os_device_t *os_uart_2 = os_usart_2_init();
    
    for (i = 0; i < key_table_size; i++)
    {
        os_pin_mode(key_table[i].pin, key_table[i].mode);
    }
    char cmd_h;
    while (1)
    {

        
        rx_cnt = os_device_read_nonblock(os_uart_2,0,USART2_RX_BUF,USART2_MAX_RX_LEN);
        
        if (rx_cnt != 0 && rx_cnt > 0)
        {
            //lcd_show_string(10, 150, 200, 300, 16, (char *)USART2_RX_BUF, BLUE); /* 显示读到的字符串 */
            
			  
			  		cmd_h=USART2_RX_BUF[0]>>4;
					switch (cmd_h)
					 {
					 /* do own thing here */
					 case 6:case 2:case 3:case 4:{
						  os_kprintf("Recv submessage cmd: cmd_type=0x1-4x\r\n");
						  device_control.d_switch=USART2_RX_BUF[0];
						  os_sem_post(sem_mqtt_task1);
						  break;}
					case 5:{
						  os_kprintf("Recv submessage cmd: cmd_type=0x5x\r\n");	 
						  device_control.door=USART2_RX_BUF[0];
						  os_sem_post(sem_door);
						// mqtt_task3_num=1;
						  break;}
					 default:
						        break;
					  }
					 memset(USART2_RX_BUF, 0, USART2_MAX_RX_LEN);
        
                
				  }
		   os_task_msleep(100);
    }
}



/**
 * @brief       初始化（屏幕 molink）
 * @param       parameter : 传入参数(未用到)
 * @retval      无
 */
int all_init(){
	my_device_init();
	
	device_state.sound_num=0;
	device_state.light_num=0;
	device_state.mq2_num=0;
	
	lcd_conf.page=0;
	lcd_conf.cursor=0;
	
	cmiot_int8 rst_update = E_CMIOT_FAILURE;
	
	adc_1 = os_device_find("adc1");
	adc_2 = os_device_find("adc2");
	adc_3 = os_device_find("adc3");
//	OS_ASSERT_EX(OS_NULL != adc_1, "adc1 device not find! \r\n");
	OS_ASSERT_EX(OS_NULL != adc_2, "adc2 device not find! \r\n");
	OS_ASSERT_EX(OS_NULL != adc_3, "adc3 device not find! \r\n");
	os_device_open(adc_1);
	os_device_open(adc_2);
	os_device_open(adc_3);
//	adc_1 = os_device_open_s("adc1");
//	adc_2 = os_device_open_s("adc2");
//	adc_3 = os_device_open_s("adc3");
	os_device_control(adc_1, OS_ADC_CMD_ENABLE, OS_NULL);
	os_device_control(adc_2, OS_ADC_CMD_ENABLE, OS_NULL);
	os_device_control(adc_3, OS_ADC_CMD_ENABLE, OS_NULL);
    /* 手动创建模块 */
    mo_object_t *test_module = OS_NULL;
    mo_object_t *temp_module = OS_NULL;
    os_err_t ret = OS_EOK;
   lcd_show_string(30, 10, 200, 16, 16, "iZone V1.0", RED);
	lcd_show_string(30, 30, 200, 16, 16, "Welcome!!!", DARKBLUE);

	
	
	lcd_show_string(30, 70, 200, 16, 16, "Connnecting WiFi...", DARKBLUE);
    os_uart_3 = os_device_find("uart3");  /* 寻找设备 */
    struct serial_configure config = OS_SERIAL_CONFIG_DEFAULT;   /* 设置默认 */
    config.baud_rate = BAUD_RATE_115200;                         /* 设置波特率 */
    os_device_control(os_uart_3, OS_DEVICE_CTRL_CONFIG, &config);/* 管理设备 */
    
    /* hardware reset esp8266 */
    esp8266_hw_rst(ESP8266_RST_PIN_NUM);
    os_task_msleep(3000);

    mo_parser_config_t parser_config = {.parser_name   = TEST_MODULE_NAME,
                                        .parser_device = os_uart_3,
                                        .recv_buff_len = RECV_BUF_LEN};
    
    test_module = mo_create("esp8266", MODULE_TYPE_ESP8266, &parser_config); /* 创建molink */
    OS_ASSERT(OS_NULL != test_module);

    temp_module = mo_get_default();    /* 获取molink句柄 */
    OS_ASSERT(OS_NULL != temp_module);

    /* esp8266 connect ap */
    ret = mo_wifi_connect_ap(test_module, AP_SSID, AP_PASSWORD);
    OS_ASSERT(OS_EOK == ret);
    

	  rst_update = cmiot_report_upgrade();
	 if (E_CMIOT_SUCCESS == rst_update)
    {
     os_kprintf("\r\n UPDATE_SUCCESS \r\n");
		  lcd_show_string(30, 170, 200, 16, 16, "OTA success", BLACK);
     }
	 
	 lcd_show_string(30, 110, 200, 16, 16, "Success connect WiFi", RED);
	 	
	  lcd_show_string(30, 130, 200, 16, 16, "Press any KEY to start", BLACK);
	  
	  //lcd_show_string(30, 190, 200, 16, 16, "OTA to V2.0", RED);
	
	return 0;
}
/**
 * @brief       按键检测
 * @param       parameter : 传入参数(未用到)
 * @retval      无
 */
static void key_task(void *parameter)
{
    parameter = parameter;
    os_uint8_t i;
    os_uint8_t key = 0;
  
    for (i = 0; i < key_table_size; i++)
    {
        os_pin_mode(key_table[i].pin, key_table[i].mode);
    }
    
    while (1)
    {
        key = key_scan(0);
        
        if (key == WKUP_PRES)   		//返回
		  {
			  k_ok=0;
			  is_using_lend=0;
			  k_back=1;
            if(lcd_conf.page>0){
					lcd_conf.page=0;
					lcd_conf.cursor=0;
					os_sem_post(sem_lcd);
					
				}
				
			  
        }
        else if(key == KEY1_PRES)	//确认
		  {
			  if(lcd_conf.page==3) k_ok=1;
				  
			  else{
				lcd_conf.page=lcd_conf.cursor;
				  lcd_conf.cursor=0;
			  os_sem_post(sem_lcd);
			  }
			  
		  }
		  else if(key == KEY0_PRES)	//指针加一
		  {
			  lcd_conf.cursor++;
			  if(lcd_conf.cursor>4)lcd_conf.cursor=1;
			  os_sem_post(sem_lcd);
			  
		  }
		  
        os_task_msleep(10);		
    }
//    while (1)
//    {
//        key = key_scan(0);
//        
//        if (key == WKUP_PRES)   //
//		  {
//            ;
//        }
//        else if(key == KEY1_PRES)
//		  {
//			  os_sem_post(sem_ota);//更改OTA信号量
//			  
//		  }
//		  else if(key == KEY0_PRES)
//		  {
//			  ;
//			  
//		  }
//        os_task_msleep(10);
//    }
}

/**
 * @brief       LCD刷新
 * @param       parameter : 传入参数(未用到)
 * @retval      无
 */

static void lcd_task(void *parameter)
{
    parameter = parameter;
	 while(1){
		 if (OS_EOK == os_sem_wait(sem_lcd, OS_WAIT_FOREVER)){
			  switch(lcd_conf.page){
				  case(0):{
					    lcd_clear(WHITE);
					   lcd_show_string(30, 10, 200, 16, 16, "iZone", RED);
						lcd_show_string(30, 30, 200, 16, 16, "Device State", DARKBLUE);  //pag1
						lcd_show_string(30, 50, 200, 16, 16, "Device Control", DARKBLUE);//pag2
					   lcd_show_string(30, 70, 200, 16, 16, "Device Lend", DARKBLUE);   //pag3
					   lcd_show_string(30, 90, 200, 16, 16, "Device OTA", DARKBLUE);    //pag4
					   
					  break;
				  }					  
				  case(1):{
						lcd_clear(WHITE);
					  lcd_show_string(30, 10, 200, 16, 16, "Device State", BLACK);
					  break;
				  }
				  case(2):{
						lcd_clear(WHITE);
					  lcd_show_string(30, 10, 200, 16, 16, "Device Control", BLACK);
					  break;
				  }
				  case(3):{
						lcd_clear(WHITE);
					  lcd_show_string(30, 10, 200, 16, 16, "Device Lend", BLACK);
					  os_sem_post(sem_lend);//更改OTA信号量
					  break;
				  }
												  
