Anuo-shuo/iZone/projects/stm32f103zet6-atk-elite/application/main.c
				  case(4):{
				   	lcd_clear(WHITE);
					  lcd_show_string(30, 10, 200, 16, 16, "OTA", BLACK);
					  os_sem_post(sem_ota);//更改OTA信号量
					  break;
				  }
				  
			  }
			  if(lcd_conf.page==0&&lcd_conf.cursor>0)lcd_fill_circle(15, lcd_conf.cursor*20+18,5,LIGHTGREEN);
			
		 }
	 }
    
}

/**
 * @brief       OTA升级
 * @param       parameter : 传入参数(未用到)
 * @retval      无
 */

static void ota_task(void *parameter)
{
    parameter = parameter;
    cmiot_int8 rst = E_CMIOT_FAILURE;
	 while(1){
		 if (OS_EOK == os_sem_wait(sem_ota, OS_WAIT_FOREVER)){
			  rst = cmiot_upgrade();
		//	 os_kprintf("\r\nrst: %d \r\n",&rst);
			  if (E_CMIOT_SUCCESS == rst){
				  lcd_show_string(30, 50, 200, 16, 16, "Download Success!", RED);
				  lcd_show_string(30, 70, 200, 16, 16, "Please Reset (Press RST) ", BLACK);
					os_kprintf("\r\n DOWNLOAD_SUCCESS \r\n");
					os_kprintf("\r\n PLEASE RESET \r\n");
	  //          lcd_show_string(30, 70, 200, 16, 16, "CMIOT_SUCCESS", BLUE);
			  }
			  else if (E_CMIOT_LAST_VERSION == rst){		  
					os_kprintf("\r\n LAST_VERSION \r\n");
				  lcd_show_string(30, 50, 200, 16, 16, "Last Version", RED);
			  }
		 }
	 }
    
}
/**
 * @brief       ONENET MQTT发送
 * @param       parameter : 传入参数(未用到)
 * @retval      无
 */
static void mqtt_task(void *parameter)
{
	
	    /* 连接onenet mqtt */
    onenet_mqtts_device_start();
	


	//MQTT接收后执行onenet_mqtts.c的submessage_cmd_request_arrived_handler
	onenet_mqtts_device_subscribe();
	
    parameter = parameter;
    os_err_t rc;
     char pub_buf1[PUB_DATA_BUFF_LEN] = {0};
	 char pub_buf2[PUB_DATA_BUFF_LEN] = {0};
	 char pub_buf3[PUB_DATA_BUFF_LEN] = {0};
	 char pub_buf4[PUB_DATA_BUFF_LEN] = {0};
	 char pub_buf5[PUB_DATA_BUFF_LEN] = {0};
	 char pub_buf6[PUB_DATA_BUFF_LEN] = {0};
    char *pub_msg = OS_NULL;
    int pub_msg_len = 0;
    mq_msg_t mq_msg;
    int id = 0;

    int send_num = 0;

    while (1)
    {
        if (onenet_mqtts_device_is_connected() == 1) /* 判断设备是否连接 */
        {
            send_num ++;

            if (id != 2147483647)
            {
                id++;
            }
            else
            {
                id = 1;
            }

//            ++device_state.temperature;
//            ++device_state.power;
//            device_state.temperature %= 40;
//            device_state.power %= 99;
				//将数据合并后拷贝到pub_buf中
            //os_snprintf(pub_buf, sizeof(pub_buf), onenet_base_dp_upload_str, id, device_state.temperature, device_state.power);
			/***********************************************/
			FILL_MSG1;//在upload_msg.h里
            pub_msg = pub_buf1;
            pub_msg_len = strlen(pub_msg);
            memset(&mq_msg, 0x00, sizeof(mq_msg));		//清零
            mq_msg.topic_type = DATA_POINT_TOPIC;		//主题类型
            memcpy(mq_msg.data_buf, pub_msg, pub_msg_len);	//将 pub_msg的值拷贝到消息队列的消息内容数组
            mq_msg.data_len = pub_msg_len;				//消息长度
//			os_kprintf("msg1_len %d \n", mq_msg.data_len);
            rc = os_mq_send(&mqtts_mq, (void *)&mq_msg, sizeof(mq_msg_t), 0);  /* 发送数据 */
            if (rc != OS_EOK)
            {
                os_kprintf("\r\n 1 mqtts_device_messagequeue_send ERR\r\n");
            }
				os_task_msleep(950);
			/***********************************************/
				id++;
				FILL_MSG2;//在upload_msg.h里
            pub_msg = pub_buf2;
            pub_msg_len = strlen(pub_msg);
            memset(&mq_msg, 0x00, sizeof(mq_msg));		//清零
            mq_msg.topic_type = DATA_POINT_TOPIC;		//主题类型
            memcpy(mq_msg.data_buf, pub_msg, pub_msg_len);	//将 pub_msg的值拷贝到消息队列的消息内容数组
            mq_msg.data_len = pub_msg_len;				//消息长度
//				 os_kprintf("msg2_len %d \n", mq_msg.data_len);
            rc = os_mq_send(&mqtts_mq, (void *)&mq_msg, sizeof(mq_msg_t), 0);  /* 发送数据 */
            if (rc != OS_EOK)
            {
                os_kprintf("\r\n 2 mqtts_device_messagequeue_send ERR\r\n");
            }
				os_task_msleep(950);
			/***********************************************/
				id++;
				FILL_MSG3;//在upload_msg.h里
            pub_msg = pub_buf3;
            pub_msg_len = strlen(pub_msg);
            memset(&mq_msg, 0x00, sizeof(mq_msg));		//清零
            mq_msg.topic_type = DATA_POINT_TOPIC;		//主题类型
            memcpy(mq_msg.data_buf, pub_msg, pub_msg_len);	//将 pub_msg的值拷贝到消息队列的消息内容数组
            mq_msg.data_len = pub_msg_len;				//消息长度
//				 os_kprintf("msg3_len %d \n", mq_msg.data_len);
            rc = os_mq_send(&mqtts_mq, (void *)&mq_msg, sizeof(mq_msg_t), 0);  /* 发送数据 */
            if (rc != OS_EOK)
            {
                os_kprintf("\r\n 3 mqtts_device_messagequeue_send ERR\r\n");
            }
				os_task_msleep(950);
			/***********************************************/
				id++;
				FILL_MSG4;//在upload_msg.h里
            pub_msg = pub_buf4;
            pub_msg_len = strlen(pub_msg);
            memset(&mq_msg, 0x00, sizeof(mq_msg));		//清零
            mq_msg.topic_type = DATA_POINT_TOPIC;		//主题类型
            memcpy(mq_msg.data_buf, pub_msg, pub_msg_len);	//将 pub_msg的值拷贝到消息队列的消息内容数组
            mq_msg.data_len = pub_msg_len;				//消息长度
//				 os_kprintf("msg4_len %d \n", mq_msg.data_len);
            rc = os_mq_send(&mqtts_mq, (void *)&mq_msg, sizeof(mq_msg_t), 0);  /* 发送数据 */
            if (rc != OS_EOK)
            {
                os_kprintf("\r\n 4 mqtts_device_messagequeue_send ERR\r\n");
            }
				os_task_msleep(950);
			/***********************************************/
				id++;
				FILL_MSG5;//在upload_msg.h里
            pub_msg = pub_buf5;
            pub_msg_len = strlen(pub_msg);
            memset(&mq_msg, 0x00, sizeof(mq_msg));		//清零
            mq_msg.topic_type = DATA_POINT_TOPIC;		//主题类型
            memcpy(mq_msg.data_buf, pub_msg, pub_msg_len);	//将 pub_msg的值拷贝到消息队列的消息内容数组
            mq_msg.data_len = pub_msg_len;				//消息长度
//				 os_kprintf("msg5_len %d \n", mq_msg.data_len);
            rc = os_mq_send(&mqtts_mq, (void *)&mq_msg, sizeof(mq_msg_t), 0);  /* 发送数据 */
            if (rc != OS_EOK)
            {
                os_kprintf("\r\n 5 mqtts_device_messagequeue_send ERR\r\n");
            }
				os_task_msleep(950);
        
		  
			/***********************************************/
				if(device_state.light_num>0||device_state.sound_num>0||device_state.mq2_num>0){
					id++;
					FILL_MSG6;//在upload_msg.h里
					pub_msg = pub_buf6;
					pub_msg_len = strlen(pub_msg);
					memset(&mq_msg, 0x00, sizeof(mq_msg));		//清零
					mq_msg.topic_type = DATA_POINT_TOPIC;		//主题类型
					memcpy(mq_msg.data_buf, pub_msg, pub_msg_len);	//将 pub_msg的值拷贝到消息队列的消息内容数组
					mq_msg.data_len = pub_msg_len;				//消息长度
	//				 os_kprintf("msg5_len %d \n", mq_msg.data_len);
					rc = os_mq_send(&mqtts_mq, (void *)&mq_msg, sizeof(mq_msg_t), 0);  /* 发送数据 */
					if (rc != OS_EOK)
					{
						 os_kprintf("\r\n 5 mqtts_device_messagequeue_send ERR\r\n");
					}
					os_task_msleep(950);
				}
        }
        
//        if (send_num > 2)
//        {
//			  
//			  /* 断开onenet mqtt */
//        //    onenet_mqtts_device_end();
//            lcd_show_string(30, 70, 200, 16, 16, "onenet_disconnect", BLUE);
//            break;
//        }

        os_task_msleep(1000);
    }
}
/**
 * @brief       MQTT接收到0x01后执行task1
 * @param       parameter : 传入参数(未用到)
 * @retval      无
 */
static void mqtt_task1(void *parameter)
{
	parameter=parameter;
	while(1){
		 if (OS_EOK == os_sem_wait(sem_mqtt_task1, OS_WAIT_FOREVER)){
			 os_kprintf("\r\n MQTT_TASK1 \r\n");
			 my_device_cmd_control(device_control.d_switch);
			 os_kprintf("\r\n d_switch %d \r\n",device_control.d_switch);
			// device_control.d_switch=0;
		 } 
	 }
	
