Anuo-shuo/iZone/projects/stm32f103zet6-atk-elite/application/main.c
}
/**
 * @brief       外借任务
 * @param       parameter : 传入参数(未用到)
 * @retval      无
 */
static void mqtt_task2(void *parameter)
{
	parameter=parameter;
	while(1){
		 if (OS_EOK == os_sem_wait(sem_lend, OS_WAIT_FOREVER)){
			 lcd_clear(WHITE);
			 is_using_lend=1;
			  for(int j=0;j<9;j++){
				device_state.nfc_id_last[j]=0;
				device_state.nfc_id_now[j]=0;
			  }				  
			 while(1){
				
//			 device_state.nfc_id_last[0]='a';
//			 device_state.nfc_id_last[1]='a';
//			 device_state.nfc_id_last[2]='a';
//			 device_state.nfc_id_last[3]='a';
//			 device_state.nfc_id_last[4]='a';
//			 device_state.nfc_id_last[5]='a';
//			 device_state.nfc_id_last[6]='a';
//			 device_state.nfc_id_last[7]='a';
//			 device_state.nfc_id_last[8]=0;
			 
			 os_kprintf("\r\n MQTT_TASK2 \r\n");
			 lcd_show_string(30, 10, 200, 16, 16, "Device Lend", BLACK);
			 lcd_show_string(30, 30, 200, 16, 16, "Please swipe Card", DARKBLUE);  //pag1
			 lcd_show_string(30, 50, 200, 16, 16, device_state.nfc_id_last, RED);  //pag1
			 lcd_show_string(30, 70, 200, 16, 16, "Device RFID", DARKBLUE);  //pag1
			 lcd_show_string(30, 90, 200, 16, 16, device_state.nfc_id_now, RED);  //pag1
			 if(k_ok){
				 lcd_show_string(30, 130, 200, 16, 16, "Lend Over", RED);  //pag1
				 lcd_show_string(30, 150, 200, 16, 16, "Press UP to Exit", RED);  //pag1
				 if(device_state.nfc_id_last[0]!=0&&device_state.nfc_id_now[0]!=0)os_sem_post(sem_lend_post );		
				 k_ok=0;
				 break;
			 }
			 if(k_back) break;
			 os_task_msleep(1000);
			}
			 
		 } 
		 is_using_lend=0;
	 }
	
}
/**
 * @brief       数据联动
 * @param       parameter : 传入参数(未用到)
 * @retval      无
 */
static void mqtt_task3(void *parameter)
{
	parameter=parameter;
	while(1){
//		 if (OS_EOK == os_sem_wait(sem_mqtt_task3, OS_WAIT_FOREVER)){
//			 os_kprintf("\r\n MQTT_TASK3 \r\n");
//			 
//		 } 
		
 
		 if(device_state.mq2_d==1) {
			 device_state.mq2_num++;
				 device_control.d_switch=0x61;
			os_sem_post(sem_mqtt_task1 );		 
			 device_control.d_switch=0x21;
			os_sem_post(sem_mqtt_task1 );

			 os_task_msleep(3000);
			 			 device_control.d_switch=0x60;
			os_sem_post(sem_mqtt_task1 );
			 device_control.d_switch=0x20;
			os_sem_post(sem_mqtt_task1 );

		 }
		 if(device_state.sound==1){
			 device_state.sound_num++;
			 device_control.d_switch=0x21;
			os_sem_post(sem_mqtt_task1 );
			 os_task_msleep(3000);
			 device_control.d_switch=0x20;
			os_sem_post(sem_mqtt_task1 );
		 }
		 if(device_state.light_d==1){
			 device_state.light_num++;
		 }
		 
//		 	os_kprintf("\r\nsound=%d\r\n",device_state.sound_num);	 
//		  os_kprintf("\r\nMQ2=%d\r\n",device_state.mq2_num);	
//		 os_kprintf("\r\nlight=%d\r\n",device_state.light_num);	
		 os_task_msleep(500);
	 }
	
}

/**
 * @brief       外借上传
 * @param       parameter : 传入参数(未用到)
 * @retval      无
 */
static void lend_task(void *parameter)
{
	parameter=parameter;
	os_err_t rc;
    char pub_buf_lend[PUB_DATA_BUFF_LEN] = {0};

    char *pub_msg = OS_NULL;
    int pub_msg_len = 0;
    mq_msg_t mq_msg;
	while(1){
		 if (OS_EOK == os_sem_wait(sem_lend_post, OS_WAIT_FOREVER)){
			 os_kprintf("\r\n MQTT_LEND \r\n");
			 lcd_show_string(30, 190, 200, 16, 16, "LEND OK.", DARKBLUE);  //pag1
			  
			 
			 FILL_MSG_LEND;//在upload_msg.h里
            pub_msg = pub_buf_lend;
            pub_msg_len = strlen(pub_msg);
            memset(&mq_msg, 0x00, sizeof(mq_msg));		//清零
            mq_msg.topic_type = DATA_POINT_TOPIC;		//主题类型
            memcpy(mq_msg.data_buf, pub_msg, pub_msg_len);	//将 pub_msg的值拷贝到消息队列的消息内容数组
            mq_msg.data_len = pub_msg_len;				//消息长度
			 os_kprintf("msg_nfc: %s \n", mq_msg.data_buf);
            rc = os_mq_send(&mqtts_mq, (void *)&mq_msg, sizeof(mq_msg_t), 0);  /* 发送数据 */
            if (rc != OS_EOK)
            {
                os_kprintf("\r\n NFC mqtts_device_messagequeue_send ERR\r\n");
            }
				os_task_msleep(950);
		 } 
		
	 }
	
}


/**
 * @brief       nfc读取到ID后，publish ID与开关门操作
 * @param       parameter : 传入参数(未用到)
 * @retval      无
 */
static void nfc_task(void *parameter)
{
	parameter=parameter;
	os_err_t rc;
    char pub_buf_nfc[PUB_DATA_BUFF_LEN] = {0};

    char *pub_msg = OS_NULL;
    int pub_msg_len = 0;
    mq_msg_t mq_msg;
	while(1){
		 if (OS_EOK == os_sem_wait(sem_nfc, OS_WAIT_FOREVER)){
			 
			 os_kprintf("\r \n nfc open door \r \n");
			 device_control.door=0x52;
			os_sem_post(sem_door);
			 
			 FILL_MSG_NFC;//在upload_msg.h里
            pub_msg = pub_buf_nfc;
            pub_msg_len = strlen(pub_msg);
            memset(&mq_msg, 0x00, sizeof(mq_msg));		//清零
            mq_msg.topic_type = DATA_POINT_TOPIC;		//主题类型
            memcpy(mq_msg.data_buf, pub_msg, pub_msg_len);	//将 pub_msg的值拷贝到消息队列的消息内容数组
            mq_msg.data_len = pub_msg_len;				//消息长度
			 os_kprintf("msg_nfc_nfc_task: %s \n", mq_msg.data_buf);
            rc = os_mq_send(&mqtts_mq, (void *)&mq_msg, sizeof(mq_msg_t), 0);  /* 发送数据 */
            if (rc != OS_EOK)
            {
                os_kprintf("\r\n NFC mqtts_device_messagequeue_send ERR\r\n");
            }
				os_task_msleep(950);
			 
		 } 
	 }
	
}
/**
 * @brief       模拟量检测与传感器
 * @param       parameter : 传入参数(未用到)
 * @retval      无
 */
static void adc_task(void *parameter)
{
	parameter=parameter;
	os_device_t *sensor_temp = os_device_open_s("temp_aht10");
	os_device_t *sensor_humi = os_device_open_s("humi_aht10");
	
	struct os_sensor_info sensor_info_temp;
	struct os_sensor_info sensor_info_humi;

   os_device_control(sensor_temp, OS_SENSOR_CTRL_GET_INFO, &sensor_info_temp);
	os_device_control(sensor_humi, OS_SENSOR_CTRL_GET_INFO, &sensor_info_humi);


	int light_b;
	int power1=4;
	int power2=4;
	
	while(1){
		
		//sensor 温度
	   os_device_read_nonblock(sensor_temp, 0, &sensor_data_temp, sizeof(struct os_sensor_data));
		if (sensor_info_temp.unit == OS_SENSOR_UNIT_MDCELSIUS)
        {
//            os_kprintf("sensor temp (%d.%03d)\r\n", sensor_data_temp.data.temp / 1000, sensor_data_temp.data.temp % 1000);
				device_state.temperature=sensor_data_temp.data.temp / 1000;
		  }
        else if (sensor_info_temp.unit == OS_SENSOR_UNIT_DCELSIUS)
        {
//            os_kprintf("sensor temp (%d)\r\n", sensor_data_temp.data.temp);
			   device_state.temperature=sensor_data_temp.data.temp;
        }
        else
        {
            os_kprintf("invalid unit\r\n");
        }
		  //sensor 湿度
		os_device_read_nonblock(sensor_humi, 0, &sensor_data_humi, sizeof(struct os_sensor_data));
		if (sensor_info_humi.unit == OS_SENSOR_UNIT_MPERMILLAGE)
        {
//            os_kprintf("sensor humi (%d.%03d)\r\n", sensor_data_humi.data.humi / 1000, sensor_data_humi.data.humi % 1000);
				device_state.humidity=sensor_data_humi.data.humi / 1000;
		  }
        else if (sensor_info_humi.unit == OS_SENSOR_UNIT_PERMILLAGE)
        {
//            os_kprintf("sensor humi (%d)\r\n", sensor_data_humi.data.humi);
			   device_state.humidity=sensor_data_humi.data.humi;
        }
        else
        {
            os_kprintf("invalid unit\r\n");
        }
		  
	
		//功率检测
		// os_device_read_nonblock( adc_1, ADC_CHANNEL_12,&device_state.light,sizeof(device_state.light));//adc1无法使用
		os_device_read_nonblock( adc_2, 12,&power1,sizeof(power1));//POWER_SENSOR1_A_PIN
		os_device_read_nonblock( adc_2, ADC_CHANNEL_15,&power2,sizeof(power2));//POWER_SENSOR1_B_PIN
		 device_state.power=16*power1*(power1-power2)/30/1000;
//		  os_kprintf("\r\n power---->%d,%d,%d\r\n",power1,power2,device_state.power);
//		  //MQ2无效
//		 os_device_read_nonblock( adc_2, ADC_CHANNEL_10,&device_state.mq2,sizeof(device_state.mq2));
//		   os_kprintf("\r\n ch10---->%d\r\n",device_state.mq2);
		//板载光照（已验证）
		os_device_read_nonblock( adc_3, ADC_CHANNEL_6,&light_b,sizeof(light_b));
		device_state.light_b=(int)(0.06728*(3300-light_b));	 
		  
//		os_kprintf("------->%d\r\n",device_state.light_b);
		  
		os_task_msleep(1000);
	 }
	
