Anuo-shuo/iZone/projects/stm32f103zet6-atk-elite/application/main.c
}
/**
 * @brief       门开关
 * @param       parameter : 传入参数(未用到)
 * @retval      无
 */
static void door_task(void *parameter)
{
	
	
	parameter=parameter;
	
	os_uint32_t period = 20000000;  
    os_uint32_t close_pulse  = 1400000; //1500000  0度 1850000 63度     
	os_uint32_t open_pulse  = 1900000;
    os_uint32_t channel= 3;//PB8
	//板载蜂鸣器+门
	pwm_dev =  (os_pwm_device_t *)os_device_find("pwm_tim4");
	    if (pwm_dev == OS_NULL)
    {
        os_kprintf("pwm sample run failed! can't find device!\n");
       // return OS_ERROR;
    }
	//00 关闭
	//01 开启
	//02 先开后关
	os_pwm_set_period(pwm_dev, channel, period);

	while(1){
		 if (OS_EOK == os_sem_wait(sem_door, OS_WAIT_FOREVER)){
			switch(device_control.door){
				case 0x50: {
					device_state.door=0;
					os_pwm_set_pulse(pwm_dev, channel, close_pulse);
					os_pwm_enable(pwm_dev, channel);
					os_task_msleep(500);
	 				os_pwm_disable(pwm_dev, channel);
					break;
				}
				case 0x51: {
					device_state.door=1;
					os_pwm_set_pulse(pwm_dev, channel, open_pulse);
					os_pwm_enable(pwm_dev, channel);
					os_task_msleep(500);
	 				os_pwm_disable(pwm_dev, channel);
					break;
				}
				case 0x52: {
					device_state.door=1;
					os_pwm_set_pulse(pwm_dev, channel, open_pulse);
					os_pwm_enable(pwm_dev, channel);
					os_task_msleep(500);
	 				os_pwm_disable(pwm_dev, channel);
					
					os_task_msleep(3000);
					device_state.door=0;
					os_pwm_set_pulse(pwm_dev, channel, close_pulse);
					os_pwm_enable(pwm_dev, channel);
					os_task_msleep(500);
	 				os_pwm_disable(pwm_dev, channel);
					break;
				}
				
			}
			device_control.door=0;
		 } 
	 }
	
}
/*
 * @brief       TOUCH中断函数
 * @param       parameter : 传入参数(未用到)
 * @retval      无
 */
static void touch_irq(void *args)
{
//	os_task_msleep(20);
	if(os_pin_read(TOUCH_SENSOR_PIN)){
	device_control.door=0x52;
	os_kprintf("\r\n irq \r\n");
    os_sem_post(sem_door);
	
	}
}

/**
 * @brief       MQTT接收的数据检测
 * @param       parameter : 传入参数(未用到)
 * @retval      无
 */
static void mqtt_cmd(void *parameter)
{
	parameter=parameter;
	char cmd_h;
	while(1){
		cmd_h=mqtt_receive_data>>4;
		switch (cmd_h)
		 {
		 /* do own thing here */
		 case 6:case 2:case 3:case 4:{
			  os_kprintf("Recv submessage cmd: cmd_type=0x1-4x\r\n");
			  device_control.d_switch=mqtt_receive_data;
			  os_sem_post(sem_mqtt_task1);
			// mqtt_task1_num=1;
			  break;}
//		 case 2:{
//			  os_kprintf("Recv submessage cmd: cmd_type=0x2x\r\n");
//			os_sem_post(sem_mqtt_task2);
//			// mqtt_task2_num=1;
//			  break;}
//		 case 3:{
//			  os_kprintf("Recv submessage cmd: cmd_type=0x3x\r\n");
//			 os_sem_post(sem_mqtt_task3);
//			// mqtt_task3_num=1;
//			  break;}
//		 case 4:{
//			  os_kprintf("Recv submessage cmd: cmd_type=0x4x\r\n");
//			 os_sem_post(sem_mqtt_task3);
//			// mqtt_task3_num=1;
//			  break;}
		case 5:{
			  os_kprintf("Recv submessage cmd: cmd_type=0x5x\r\n");	 
			device_control.door=mqtt_receive_data;
			os_sem_post(sem_door);
			// mqtt_task3_num=1;
			  break;}
		 default:
			  break;
		 }
		 mqtt_receive_data=0;
		 os_task_msleep(100);		
	 }
	
}

static void ShowID(unsigned char *p)
{
//  unsigned char num[9];
//    unsigned char i;

//    for(i=0; i<4; i++)
//    {
//        num[i*2]=p[i]/16;
//        num[i*2]>9?(num[i*2]+='7'):(num[i*2]+='0');
//        num[i*2+1]=p[i]%16;
//        num[i*2+1]>9?(num[i*2+1]+='7'):(num[i*2+1]+='0');
//    }
//    num[8]=0;
//    os_kprintf("ID>>>%s\r\n", num);
    unsigned char i;
	 for(i=0; i<9; i++)
    {		 
		 device_state.nfc_id_last[i]=device_state.nfc_id_now[i];
	 }
    for(i=0; i<4; i++)
    {
        device_state.nfc_id_now[i*2]=p[i]/16;
        device_state.nfc_id_now[i*2]>9?(device_state.nfc_id_now[i*2]+='7'):(device_state.nfc_id_now[i*2]+='0');
        device_state.nfc_id_now[i*2+1]=p[i]%16;
        device_state.nfc_id_now[i*2+1]>9?(device_state.nfc_id_now[i*2+1]+='7'):(device_state.nfc_id_now[i*2+1]+='0');
    }
    device_state.nfc_id_now[8]=0;
	 os_kprintf("last ID>>>%s\r\n", device_state.nfc_id_last);
    os_kprintf("ID>>>%s\r\n", device_state.nfc_id_now);

}

//static os_uint8_t rfid_stack[ 512 ];
//static struct rt_thread rfid_thread;
static void rc522_task(void* parameter)
{
//    unsigned int count=0;

    char status;
	//unsigned char snr, buf[16], TagType[2], SelectedSnr[4], DefaultKey[6] = {0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF};
    unsigned char  TagType[2], SelectedSnr[4];
  PcdInit();
	PcdReset();
	PcdAntennaOff();
	PcdAntennaOn();
	M500PcdConfigISOType( 'A' );
 
  os_kprintf( "rc522 init over!\n" );

  while(1){
    status= PcdRequest( REQ_ALL , TagType );
		if(!status) {
			status = PcdAnticoll(SelectedSnr);
			if(!status){
				status=PcdSelect(SelectedSnr);
				if(!status){
					ShowID(SelectedSnr);//读取ID
				//	os_kprintf( "+++++++++++++++++++++++ %d\n" ,is_using_lend);
					if(!is_using_lend) {
				//	os_kprintf( "************************\n" );
					os_sem_post(sem_nfc);}
					//os_task_msleep(10);
				//	os_kprintf( "-----------------------\n" );
					
					/*unsigned char inDoor[16] = {
							0x91, 0x94, 0x09, 0xa5, 0xa9, 0x88, 0x04, 0x00, 
							0x85, 0x00, 0xb4, 0x2e, 0xf0, 0xbb, 0x6a, 0xa8
						};
					unsigned char outDoor[16] = {
						0x1c, 0x6a, 0xa0, 0xa5, 0x73, 0x88, 0x04, 0x00,
						0x85, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00
					};
					status = PcdSpicelWrite(inDoor);*/
					//读取所有数据（已验证）
//					if(!status){
//						for(int i = 0;i < 16 ;i++){
//							snr = i;
//							status = PcdAuthState(KEYB, (snr*4+3), DefaultKey, SelectedSnr);
//							for(int j = 0; j < 4; j++){
//								status = PcdRead((snr*4+j), buf);
//								//status = PcdWrite((snr*4+0), "way2"); 
//								if(!status){
//									uint16_t * e = 0;
//									e = (uint16_t *)TagType;
//									//os_kprintf("Snr Index : %d, type = %x \n", snr * 4 + j, *e);
//									for(int n = 0; n < 16; n++){
//										os_kprintf("%x ", (uint16_t)buf[n]);
//									}	
//									os_kprintf("\n");	
//								}
//							}
//						}
//					}
				//	os_kprintf("operate finished! %x \n", status);
					WaitCardOff();
					 
