Anuo-shuo/iZone/projects/stm32f103zet6-atk-elite/application/main.c
				}
			}
		}
		os_task_msleep(500);
	}
}





int main(void)
{
	

   

//	TIM_HandleTypeDef  htim8;
	

	//初始化
    all_init();
	

  /* USER CODE BEGIN 2 */
//HAL_TIM_PWM_Start(&htim8,TIM_CHANNEL_1);//***定时器初始化
	
	//信号量创建
	 sem_ota = os_sem_create("sem_ota", 0,1);
	 sem_lcd = os_sem_create("sem_lcd", 0,1);
	 sem_mqtt_task1= os_sem_create("sem_mqtt_task1", 0,1);//mqtt_task1信号量
    //sem_mqtt_task2= os_sem_create("sem_mqtt_task2", 0,1);//mqtt_task2信号量
    //sem_mqtt_task3= os_sem_create("sem_mqtt_task3", 0,1);//mqtt_task3信号量
	sem_lend= os_sem_create("sem_lend", 0,1);//外借任务
	sem_lend_post= os_sem_create("sem_lend_post", 0,1);//上传任务
	 sem_door = os_sem_create("sem_door", 0,1);//door
	 sem_nfc = os_sem_create("sem_nfc", 0,1);//nfc
	// OS_ASSERT_EX(OS_NULL != sem_ota, "sem_ota create err!\r\n");
	
	
    /* 绑定中断，上升沿模式，回调函数名为touch_irq */
    os_pin_attach_irq(TOUCH_SENSOR_PIN, PIN_IRQ_MODE_RISING, touch_irq, OS_NULL);
    /* 使能中断 */
    os_pin_irq_enable(TOUCH_SENSOR_PIN, PIN_IRQ_ENABLE);
	 
	 
	 
	//任务创建
    MQTT_Handler = os_task_create(  "mqtt_task",   /* 设置任务的名称 */
                                  mqtt_task,     /* 设置任务函数 */
                                  OS_NULL,              /* 任务传入的参数 */
                                  MQTT_STK_SIZE,        /* 设置任务堆栈 */
                                  MQTT_TASK_PRIO);      /* 设置任务的优先级 */
    OS_ASSERT(MQTT_Handler);
    os_task_startup(MQTT_Handler);
	
	 KEY_Handler = os_task_create("key_task", key_task, OS_NULL, KEY_STK_SIZE, KEY_TASK_PRIO);
    OS_ASSERT(KEY_Handler);
    os_task_startup(KEY_Handler);
	
	 OTA_Handler = os_task_create("ota_task", ota_task, OS_NULL, OTA_STK_SIZE, OTA_TASK_PRIO);      
    OS_ASSERT(OTA_Handler);
    os_task_startup(OTA_Handler);
	 
	 LCD_Handler = os_task_create("lcd_task", lcd_task, OS_NULL, LCD_STK_SIZE, LCD_TASK_PRIO);      
    OS_ASSERT(LCD_Handler);
    os_task_startup(LCD_Handler);
	 
	 MQTT_TASK1_Handler = os_task_create("mqtt_task1", mqtt_task1, OS_NULL, MQTT_TASK1_STK_SIZE, MQTT_TASK1_TASK_PRIO);      
    OS_ASSERT(MQTT_TASK1_Handler);
    os_task_startup(MQTT_TASK1_Handler);
	 
	 MQTT_TASK2_Handler = os_task_create("mqtt_task2", mqtt_task2, OS_NULL, MQTT_TASK2_STK_SIZE, MQTT_TASK2_TASK_PRIO);      
    OS_ASSERT(MQTT_TASK2_Handler);
    os_task_startup(MQTT_TASK2_Handler);
	 
	 MQTT_TASK3_Handler = os_task_create("mqtt_task3", mqtt_task3, OS_NULL, MQTT_TASK3_STK_SIZE, MQTT_TASK3_TASK_PRIO);      
    OS_ASSERT(MQTT_TASK3_Handler);
    os_task_startup(MQTT_TASK3_Handler);
	 
	 MQTT_CMD_Handler = os_task_create("mqtt_cmd", mqtt_cmd, OS_NULL, MQTT_CMD_STK_SIZE, MQTT_CMD_TASK_PRIO);      
    OS_ASSERT(MQTT_CMD_Handler);
    os_task_startup(MQTT_CMD_Handler);
	 
	 RC522_Handler = os_task_create("rc522_task", rc522_task, OS_NULL, RC522_STK_SIZE, RC522_TASK_PRIO);      
    OS_ASSERT(RC522_Handler);
    os_task_startup(RC522_Handler);
	
	 DOOR_Handler = os_task_create("door_task", door_task, OS_NULL, DOOR_STK_SIZE, DOOR_TASK_PRIO);      
    OS_ASSERT(DOOR_Handler);
    os_task_startup(DOOR_Handler);
	 
	 ADC_Handler = os_task_create("adc_task", adc_task, OS_NULL, ADC_STK_SIZE, ADC_TASK_PRIO);      
    OS_ASSERT(ADC_Handler);
    os_task_startup(ADC_Handler);
	 
	 NFC_Handler = os_task_create("nfc_task", nfc_task, OS_NULL, NFC_STK_SIZE, NFC_TASK_PRIO);      
    OS_ASSERT(NFC_Handler);
    os_task_startup(NFC_Handler);
	 
	 LEND_Handler = os_task_create("lend_task", lend_task, OS_NULL, LEND_STK_SIZE, LEND_TASK_PRIO);      
    OS_ASSERT(LEND_Handler);
    os_task_startup(LEND_Handler);
	 
	 TIMER_PERIODIC = os_timer_create("my_device_sensor_d", my_device_sensor_d,OS_NULL, 100, OS_TIMER_FLAG_PERIODIC);
	 OS_ASSERT_EX(OS_NULL != TIMER_PERIODIC, "timer create err\r\n");
	 os_timer_start(TIMER_PERIODIC);
	 
	 SERIAL_Handler = os_task_create("serial_task",          /* 设置任务的名称 */
                                    serial_task,            /* 设置任务函数 */
                                    OS_NULL,                /* 任务传入的参数 */
                                    SERIAL_STK_SIZE,        /* 设置任务堆栈 */
                                    SERIAL_TASK_PRIO);      /* 设置任务的优先级 */
    OS_ASSERT(SERIAL_Handler);
    os_task_startup(SERIAL_Handler);                        /* 任务开始 */
    return 0;
}
